from main import *


picture = {
    0: f"""

                                Слово:

                                {self.word}



_________________________

     Використані букви:

     $used

    """,
    1: """

                         |      Слово:
                         |
                         |      $word
                         |
                         |
                         |
_________________________|

     Використані букви:

     $used
    """,
    2: """
             ____________
                         |      Слово:
                         |
                         |      $word
                         |
                         |
                         |
_________________________|

     Використані букви:

     $used
    """,
    3: """
             ____________
                |        |      Слово:
                         |
                         |      $word
                         |
                         |
                         |
_________________________|

     Використані букви:

     $used
    """,
    4: """
             ____________
                |        |      Слово:
               ( )       |
                         |      $word
                         |
                         |
                         |
_________________________|

     Використані букви:

     $used
    """,
    5: """
             ____________
                |        |      Слово:
               ( )       |
               / \\       |      $word
                         |
                         |
                         |
_________________________|

     Використані букви:

     $used
    """,
    6: """
             ____________
                |        |      Слово:
               ( )       |
               /|\\       |      $word
                |        |
                         |
                         |
_________________________|

     Використані букви:

     $used
    """,
    7: """
             ____________
                |        |      Слово:
               ( )       |
               /|\\       |      $word
                |        |
               /         |
                         |
_________________________|

     Використані букви:

     $used
    """,
    8: """
             ____________
                |        |      Слово:
               ( )       |
               /|\\       |      $word
                |        |
               / \\       |
                         |
_________________________|

     Використані букви:

     $used
    """,
}



