"""
Hangman – інструкція до гри.

У гравця є 8 життів. Кожен хід гравець намагається
вгадати 1 букву із загаданого слова:
 - якщо користувач пише букву, яка вже була введена, то це "помилка" і програма
   просить ввести букву ще раз
 - якщо буква є декілька разів у слові, то вона відображається на всіх місцях
 - якщо користувач ввів символ не із українського алфавіту, то це "помилка" ...
 - якщо більше одного символа або 0 символів, то це "помилка"
Життя зникає тільки тоді, коли введена нова буква із українського алфавіту, але її немає в слові.
Усі букви, які було введено повинні відображатися
"""
# абстрактний підхід до написання коду

from data import *
from functions import *


class Hangman:
    def __init__(self):
        self.word = ""
        self.used_symbols = ""
        self.lives = 8















if __name__ == '__main__':
    game = Hangman()

    for row in picture.values():
        print(row)
